docs/dev notes/MK_Benchmark_NGINX.txt
Nginx proxy:
spoot@th-gluster-1:~$ ab -n 10000 -c 30 https://th-swarm-1:8900/
This is ApacheBench, Version 2.3 <$Revision: 1843412 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking th-swarm-1 (be patient)
Completed 1000 requests
Completed 2000 requests
Completed 3000 requests
Completed 4000 requests
Completed 5000 requests
Completed 6000 requests
Completed 7000 requests
Completed 8000 requests
Completed 9000 requests
Completed 10000 requests
Finished 10000 requests


Server Software:        nginx
Server Hostname:        th-swarm-1
Server Port:            8900
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES256-GCM-SHA384,2048,256
Server Temp Key:        X25519 253 bits
TLS Server Name:        th-swarm-1

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      30
Time taken for tests:   6.538 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      2810000 bytes
HTML transferred:       0 bytes
Requests per second:    1529.59 [#/sec] (mean)
Time per request:       19.613 [ms] (mean)
Time per request:       0.654 [ms] (mean, across all concurrent requests)
Transfer rate:          419.74 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        3    8   4.5      7      74
Processing:     1   11   5.6     11      95
Waiting:        1   11   5.6     11      94
Total:          5   20   7.3     19     106

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     21
  75%     22
  80%     23
  90%     26
  95%     29
  98%     33
  99%     37
 100%    106 (longest request)


*************************************

Nginx Proxy tied into uwsgi:
NA yet